% Calculo de mediana movel
% Janela de mediana utilizada = 9

% Código feito sem utilização de funções para calcular a mediana movel, de um conjunto de números

clear all

a = [0, 66.8708300000000, 59.9516000000000, 0, 0, 66.8585700000000, 0, 0, 0];

disp(median(a));

b = [66.8708300000000, 59.9516000000000, 0, 0, 66.8585700000000, 0, 0, 0, 66.8585800000000];

disp(median(b));

c = [59.9516000000000, 0, 0, 66.8585700000000, 0, 0, 0, 66.8585800000000, 66.8830800000000];

disp(median(c));

d = [0, 0, 66.8585700000000, 0, 0, 0, 66.8585800000000, 66.8830800000000, 66.8830800000000];

disp(median(d));

e = [0, 66.8585700000000, 0, 0, 0, 66.8585800000000, 66.8830800000000, 66.8830800000000, 66.8708400000000];

disp(median(e));